## production: system_status
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.system_status_email_degraded[0]`    |
|        | `aws_cloudwatch_log_metric_filter.system_status_email_down[0]`        |
|        | `aws_cloudwatch_log_metric_filter.system_status_sms_degraded[0]`      |
|        | `aws_cloudwatch_log_metric_filter.system_status_sms_down[0]`          |
|        | `aws_cloudwatch_metric_alarm.system_status_email_degraded_warning[0]` |
|        | `aws_cloudwatch_metric_alarm.system_status_email_down_warning[0]`     |
|        | `aws_cloudwatch_metric_alarm.system_status_sms_degraded_warning[0]`   |
|        | `aws_cloudwatch_metric_alarm.system_status_sms_down_warning[0]`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.system_status_email_degraded[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "system_status_email_degraded" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/system_status"
      + name           = "system_status_email_degraded"
      + pattern        = "\"'email': 'degraded'\""

      + metric_transformation {
          + name      = "system_status_email_degraded"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.system_status_email_down[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "system_status_email_down" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/system_status"
      + name           = "system_status_email_down"
      + pattern        = "\"'email': 'down'\""

      + metric_transformation {
          + name      = "system_status_email_down"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.system_status_sms_degraded[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "system_status_sms_degraded" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/system_status"
      + name           = "system_status_sms_degraded"
      + pattern        = "\"'sms': 'degraded'\""

      + metric_transformation {
          + name      = "system_status_sms_degraded"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.system_status_sms_down[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "system_status_sms_down" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/system_status"
      + name           = "system_status_sms_down"
      + pattern        = "\"'sms': 'down'\""

      + metric_transformation {
          + name      = "system_status_sms_down"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.system_status_email_degraded_warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "system_status_email_degraded_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Email system status reported as 'degraded' 2 or more times in 10 minutes"
      + alarm_name                            = "system-status-email-degraded-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "system_status_email_degraded"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 600
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 2
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.system_status_email_down_warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "system_status_email_down_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Email system status reported as 'down'"
      + alarm_name                            = "system-status-email-down-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "system_status_email_down"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.system_status_sms_degraded_warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "system_status_sms_degraded_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "SMS system status reported as 'degraded' 2 or more times in 10 minutes"
      + alarm_name                            = "system-status-sms-degraded-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "system_status_sms_degraded"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 600
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 2
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.system_status_sms_down_warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "system_status_sms_down_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "SMS system status reported as 'down'"
      + alarm_name                            = "system-status-sms-down-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "system_status_sms_down"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.system_status_testing[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.system_status_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-system_status-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-system_status-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.system_status_email_degraded_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.system_status_email_down_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.system_status_sms_degraded_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.system_status_sms_down_warning[0]"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
